// ____________________________
// ллпплппллппппппплппл        Г   ммм                мм      
// лл  п  лм  пллм п мл мпп л  Г  плм  мплл млмл ллпм лл  мллл
// л  л л  пп  мл  л  л пмл лм Г  ммлп пмлл лл л ллп  плм плмм
// ппппппппппппппппппппФФФФФФФФй                 пп
//  Program template
//ФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФ
// Encoding: OEM 850 

// ASCII-art logo
const char g_Logo[] =	"ллпплппллппппппплппл\n"
						"лл  п  лм  пллм п мл мпп л\n"
						"л  л л  пп  мл  л  л пмл лм\n"
						"пппппппппппппппппппп";