// __________________________
// ллплпллппплпплпл  ммм мм  Г   ммм                мм      
// л  м лм пллм пмл лл   лл  Г  плм  мплл млмл ллпм лл  мллл
// л  л лпп мл  л л плмл ллммГ  ммлп пмлл лл л ллп  плм плмм
// ппппппппппппппппФФФФФФФФФФй                 пп
//  Program template
//ФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФ
// Encoding: OEM 850 

// ASCII-art logo
const char g_Logo[] =	"ллплпллппплпплпл  ммм мм\n"
						"л  м лм пллм пмл лл   лл\n"
						"л  л лпп мл  л л плмл ллмм\n"
						"пппппппппппппппп";